#pragma once
/******************************************************************************
**	タイトル  :
**	ファイル名: .h
**	作成者    : AT-13B-284 出席番号 14 木村 祥貴
**	作成日    : 2016//
**	修正日	　: //
********************************************************************************/

/******************************************************************************
**	更新内容
**
**
**
******************************************************************************/

/******************************************************************************
**	インクルードファイル
******************************************************************************/
#include "Mode.h"


/******************************************************************************
**	ライブラリリンク
******************************************************************************/


/******************************************************************************
**	マクロ定義
******************************************************************************/


/******************************************************************************
**	クラス定義
******************************************************************************/
class Scene2DGL;
class CharaSelect : public Mode
{
public:
	enum State
	{
		SELECT,
		ASK
	};

	enum ButtonType
	{
		X_ACT,
		A_ACT,

		BUTTON_TYPE_NUM,
	};

	CharaSelect();
	virtual ~CharaSelect();


	// メソッド
	void Init();
	void Uninit();
	void Update();
	void Draw();

private:
	void UpdateSelectCharactor(int id);
	void UpdateSelectCheck();
	void UpdateAskToBattle();

private:
	// メンバ変数
	Scene2DGL *m_pBg;

	int m_state;									// 現在の状態
	int m_selectId[2];								// 選択キャラクターID
	bool m_isDecide[2];								// 決定フラグ
	bool m_isStartBattle;							// バトル開始

	Scene2DGL *m_pDecide[2];						// 決定(文字)
	Scene2DGL *m_pIcon[2];							// １Ｐ２Ｐ(文字)
	Scene2DGL *m_pCharactor[2];						// キャラクター画像
	Scene2DGL *m_pJobName[2];						// ジョブ名(文字)
	Scene2DGL *m_pActName[2][BUTTON_TYPE_NUM];		// プレイヤー技名(文字)
	Scene2DGL *m_pBtnIcon[2][BUTTON_TYPE_NUM];		// ボタンアイコン(AX)

	Scene2DGL *m_pDecideMask,	*m_pAskMask;		// 決定マスク(前の画面全体, 確認ウィンドウ)
	Scene2DGL *m_pAskToStart;						// 勝負をはじめる？
	Scene2DGL *m_pYes,			*m_pNo;				// はい　いいえ
};

