#pragma once
/******************************************************************************
**	タイトル  :
**	ファイル名: Color.h
**	作成者    : AT-13B-284 出席番号 14 木村 祥貴
**	作成日    : 2016/7/8
**	修正日	　: //
********************************************************************************/

/******************************************************************************
**	更新内容
**
**
**
******************************************************************************/

/******************************************************************************
**	インクルードファイル
******************************************************************************/


/******************************************************************************
**	ライブラリリンク
******************************************************************************/


/******************************************************************************
**	マクロ定義
******************************************************************************/

/* 色 */
typedef struct tagCOLOR
{
	float r, g, b, a;

}COLOR, *LPCOLOR;


/******************************************************************************
**	クラス定義
******************************************************************************/
class Color : public COLOR
{
public:
	Color();
	Color( float r, float g, float b, float a );
	Color( int r, int g, int b, int a );
	virtual ~Color();


	// メンバ関数

	/* オペレータ */
	// assignment operators
	Color& operator += ( const Color& );
	Color& operator -= ( const Color& );
	Color& operator *= ( const float );
	Color& operator /= ( const float );

	// unary operators
	Color operator + () const;
	Color operator - () const;

	// binary operators
	Color operator + ( const Color& )const;
	Color operator - ( const Color& )const;
	Color operator * ( const float )const;
	Color operator / ( const float )const;
	Color& operator = ( const unsigned long );

	// メソッド

};

