#pragma once
/******************************************************************************
**	タイトル  :
**	ファイル名: DirectInput.h
**	作成者    : AT-13B-284 出席番号 14 木村 祥貴
**	作成日    : 2016/5/10
**	修正日	　: //
********************************************************************************/

/******************************************************************************
**	更新内容
**
**
**
******************************************************************************/

/******************************************************************************
**	インクルードファイル
******************************************************************************/
#include "Input.h"

/******************************************************************************
**	ライブラリリンク
******************************************************************************/


/******************************************************************************
**	マクロ定義
******************************************************************************/


/******************************************************************************
**	クラス定義
******************************************************************************/
namespace input
{
	class DirectInput
	{
	public:
		DirectInput();
		virtual ~DirectInput();

		// 初期化、終了、更新処理
		virtual HRESULT Init( HWND ) = 0;
		virtual int Uninit() = 0;
		virtual HRESULT Update() = 0;

		// 取得方法
		virtual bool GetPress( int ); // 長押し
		virtual bool GetTrigger( int ); // トリガー
		virtual bool GetRelease( int ); // リリース
		virtual bool GetRepeat( int ); // リピート

		// リピートの速度変更
		virtual void SetRepeatSpeed( unsigned int );

		// リスト構造
		static DWORD m_dwCreateCnt; // 生成数
		static DirectInput *m_Top; // 先頭アドレス
		static DirectInput *m_Last; // 後尾アドレス
		DirectInput *m_Prev; // 前ポインタ
		DirectInput *m_Next; // 次ポインタ


	protected:
		// 入力デバイスへのポインタ
		LPDIRECTINPUTDEVICE8 lpdid;

		// 入力ワーク
		BYTE *m_State;
		BYTE *m_StateTrigger;
		BYTE *m_StateRelese;
		BYTE *m_StateRepeat;
		unsigned int *m_StateRepeatCount;
		unsigned int m_RepeatSpeed;

	};

}

