#pragma once
/******************************************************************************
**	タイトル  :
**	ファイル名: Fade.h
**	作成者    : AT-13B-284 出席番号 14 木村 祥貴
**	作成日    : 2016/7/19
**	修正日	　: //
********************************************************************************/

/******************************************************************************
**	更新内容
**
**
**
******************************************************************************/

/******************************************************************************
**	インクルードファイル
******************************************************************************/
#include "main.h"


/******************************************************************************
**	ライブラリリンク
******************************************************************************/


/******************************************************************************
**	マクロ定義
******************************************************************************/

/* フェード遷移 */
typedef enum
{
	FADE_NONE = 0,
	FADE_IN,
	FADE_OUT,
	FADE_MAX

}FADE;


/* フェードの色 */
#define FADE_R ( 0.0f )
#define FADE_G ( 0.0f )
#define FADE_B ( 0.0f )
#define FADE_A ( 1.0f )


/******************************************************************************
**	クラス定義
******************************************************************************/
class Mode;
class Color;
class Fade
{
public:
	Fade();
	virtual ~Fade();


	// メソッド
	static HRESULT Init();
	static int Uninit();
	static void Update();
	static void Draw();

	// Set,Get
	static void Set( Mode *next );
	static FADE Get();


	// メンバ変数
	static unsigned int m_Texture;
	static Color m_color;
	static FADE m_fade;
	static Mode *m_pModeNext;
	static int m_FadeTimeCount;
	static float m_Width;
	static float m_Height;

};

