#pragma once
/******************************************************************************
**	タイトル  :
**	ファイル名: .h
**	作成者    : AT-13B-284 出席番号 5 稲垣雄大
**	作成日    : 2016//
**	修正日	　: //
********************************************************************************/

/******************************************************************************
**	更新内容
**
**
**
******************************************************************************/

/******************************************************************************
**	インクルードファイル
******************************************************************************/
#include "Mode.h"
#include "main.h"


/******************************************************************************
**	ライブラリリンク
******************************************************************************/


/******************************************************************************
**	マクロ定義
******************************************************************************/
//#define HP_X_Left	(40)
//#define HP_Y_Left	(100)
//#define HP_X_Right	(640)
//#define HP_Y_Right	(200)
//
//#define HP_X_Left2	(680)
//#define HP_Y_Left2	(100)
//#define HP_X_Right2	(1280)
//#define HP_Y_Right2	(200)
//
#define HPBAR_WIDTH		( 600 )
#define HPBAR_HEIGHT	( 100 )
#define HPBAR_POSX		( 300 )
#define HPBAR_POSX_2	( 980 )
#define HPBAR_POSY		( 60 )

#define ONIGIRI_SIZE		(50)//おにぎりのｻｲｽﾞ
#define ONIGIRI_POS_X		(100)//おにぎりのＸ座宝
#define ONIGIRI_POS_Y		(30)//おにぎりのＹ座標
#define ONIGIRI_SPACE_X		(50)//おにぎりの横間隔
#define ONIGIRI_SPACE_Y		(50)//おにぎりの縦間隔
#define ONIGIRI_COUNT		(10)//おにぎりの個数


/******************************************************************************
**	構造体宣言
******************************************************************************/
typedef struct			//頂点情報のフォーマット
{
	int posX;	//頂点座標
	int colR, colG, colB;		//頂点カラー
} HP;
#define MOVE		( 60 )
#define HP_MAX			( 6 )//playerのとこにいれる

/******************************************************************************
**	クラス定義
******************************************************************************/
class Scene2DGL;
class HPbar : public Mode
{
public:
	HPbar();
	virtual ~HPbar();


	// メソッド
	void Init();
	void Uninit();
	void Update();
	void Draw();

	static HPbar *Create();

private:
	// メンバ変数
	Scene2DGL *m_pHPbar;

};

