#pragma once
/******************************************************************************
**	タイトル  :
**	ファイル名: Scene2DGL.h
**	作成者    : AT-13B-284 出席番号 14 木村 祥貴
**	作成日    : 2016/4/22
**	修正日	　: //
********************************************************************************/

/******************************************************************************
**	更新内容
**
**
**
******************************************************************************/

/******************************************************************************
**	インクルードファイル
******************************************************************************/
#include "SceneGL.h"
#include "Vector3.h"
#include "RendererGL.h"


/******************************************************************************
**	ライブラリリンク
******************************************************************************/



/******************************************************************************
**	マクロ定義
******************************************************************************/



/******************************************************************************
**	クラス定義
******************************************************************************/
class Scene2DGL : public SceneGL
{
public:
	Scene2DGL( int Priority = PRIORITY_2D );
	virtual ~Scene2DGL();

	// メソッド
	HRESULT Init(); // 初期化
	int Uninit(); // 終了
	void Update(); // 更新
	void Draw(); // 描画
	static Scene2DGL *Create();

	void AddRot(float z)			{ m_Obj3d.rot.z += z; }
	void AddPos(float x, float y)	{ AddPos(Vector3(x, y, 0.0f)); }
	void AddPos(const Vector3& v)	{ m_Obj3d.pos += v; }

	// Set,Get
	void SetParam(float *x, float *y, float *z, SCENEPARAM ParamName);
	void SetParam(Vector3 *, SCENEPARAM ParamName);

	// Delete


	// Update Fix
	void UpdateAnimation();


protected:
	// メンバ変数


private:

};

