#pragma once
/******************************************************************************
**	タイトル  :
**	ファイル名: Receive.h
**	作成者    : AT-13B-284 出席番号 14 木村 祥貴
**	作成日    : 2016/11/30
**	修正日	　: //
********************************************************************************/

/******************************************************************************
**	更新内容
**
**
**
******************************************************************************/

/******************************************************************************
**	インクルードファイル
******************************************************************************/
#include <Windows.h>
#include "WindowsSocketService.h"


/******************************************************************************
**	ライブラリリンク
******************************************************************************/


/******************************************************************************
**	マクロ定義
******************************************************************************/


/******************************************************************************
**	クラス定義
******************************************************************************/
class Server
{
public:
	Server();
	~Server();

	// メソッド
	void Init();
	static unsigned int __stdcall Receive( void *p );
	void Uninit();

	// Set
	void SetAddress( const char *ip );
	void SetPortNo( long ip );
	void SetMulticast( bool flag );

	// Get
	bool GetBufferData( _Out_ char *pOutData, _In_ int DataBufferSize );


private:
	static char m_Buffer[ MAX_PATH ];
	static char m_IP[ MAX_PATH ];
	static int m_Len;
	static int m_Protocol;
	static SOCKADDR_IN m_Addrin;
	static SOCKET m_Socket;
	static long m_PortNo;
	static bool m_bInitFlagIP;
	static bool m_bInitFlagPort;
	static bool m_bMulticastFlag;

};


