#pragma once
/******************************************************************************
**	タイトル  :
**	ファイル名: Scene2DGL.h
**	作成者    : AT-13B-284 出席番号 14 木村 祥貴
**	作成日    : 2016/4/22
**	修正日	　: //
********************************************************************************/

/******************************************************************************
**	更新内容
**
**
**
******************************************************************************/

/******************************************************************************
**	インクルードファイル
******************************************************************************/
#include "Vector3.h"
#include "RendererGL.h"


/******************************************************************************
**	ライブラリリンク
******************************************************************************/



/******************************************************************************
**	マクロ定義
******************************************************************************/



/******************************************************************************
**	クラス定義
******************************************************************************/
class Color;
class Texture2DGL
{
public:
	Texture2DGL();
	virtual ~Texture2DGL();

	// メソッド
	HRESULT Init(); // 初期化
	int Uninit(); // 終了
	void Update(); // 更新
	void Draw(); // 描画


	// Set
	void SetTexture( int TextureNo );
	void SetSize( float width, float height );
	void SetPos( Vector3 *pos );
	void SetPos( float x, float y );
	void SetRot( float z );
	void SetColor( float r, float g, float b, float a );
	void SetColor( Color col );

		
private:
	// メンバ変数
	int m_Texture;
	Vector3 m_Pos;
	Vector3 m_Rot;
	float m_Angle;
	float m_Length;
	float m_Width;
	float m_Height;
	Color m_Color;

};

