/******************************************************************************
**	タイトル  :
**	ファイル名: .cpp
**	作成者    : AT-13B-284 出席番号 14 木村 祥貴
**	作成日    : 2016//
**	修正日	　: //
********************************************************************************/

/******************************************************************************
**	インクルードファイル
******************************************************************************/

// 自身ヘッダ
#include "Texture2DGL.h"


// オブジェクト


// システム
#include "Color.h"


/******************************************************************************
**	静的メンバ変数
******************************************************************************/


/******************************************************************************
**	関数名: Texture2DGL
**		関数の概要
**	引数  : void
**	戻り値: void
**	説明  : コンストラクタ
******************************************************************************/
Texture2DGL::Texture2DGL()
{
}


/******************************************************************************
**	関数名: ~Texture2DGL
**		関数の概要
**	引数  : void
**	戻り値: void
**	説明  : デストラクタ
******************************************************************************/
Texture2DGL::~Texture2DGL()
{
}


/******************************************************************************
**	関数名: 初期化処理 Init
**		関数の概要
**	引数  :
**	戻り値: HRESULT
**	説明  : 初期化処理
******************************************************************************/
HRESULT Texture2DGL::Init()
{
	return E_NOTIMPL;
}


/******************************************************************************
**	関数名: 終了処理 Uninit
**		関数の概要
**	引数  : void
**	戻り値: int
**	説明  :
******************************************************************************/
int Texture2DGL::Uninit()
{
	return 0;
}


/******************************************************************************
**	関数名: 更新処理 Update
**		関数の概要
**	引数  : void
**	戻り値: void
**	説明  :
******************************************************************************/
void Texture2DGL::Update()
{
}


/******************************************************************************
**	関数名: 描画処理 Draw
**		関数の概要
**	引数  : void
**	戻り値: void
**	説明  :
******************************************************************************/
void Texture2DGL::Draw()
{
	// テクスチャ
	glEnable( GL_TEXTURE_2D );
	glBindTexture( GL_TEXTURE_2D, m_Texture );
	
	// 描画
	glBegin( GL_TRIANGLE_STRIP );

	glColor4f( m_Color.r, m_Color.g, m_Color.b, m_Color.a );
	glTexCoord2f( 0.0f, 0.0f );
	glVertex2d( m_Pos.x - m_Width * 0.5f, m_Pos.y + m_Height * 0.5f );

	glTexCoord2f( 1.0f, 0.0f );
	glVertex2d( m_Pos.x + m_Width * 0.5f, m_Pos.y + m_Height * 0.5f );

	glTexCoord2f( 0.0f, 1.0f );
	glVertex2d( m_Pos.x - m_Width * 0.5f, m_Pos.y - m_Height * 0.5f );

	glTexCoord2f( 1.0f, 1.0f );
	glVertex2d( m_Pos.x + m_Width * 0.5f, m_Pos.y - m_Height * 0.5f );

	glEnd();

	// テクスチャ削除
	glDisable( GL_TEXTURE_2D );

}


/******************************************************************************
**	関数名: SetTexture
**	関数の概要
**	引数  : int TextureNo
**	戻り値: void
**	説明  :
******************************************************************************/
void Texture2DGL::SetTexture( int TextureNo )
{
	m_Texture = TextureNo;

}


/******************************************************************************
**	関数名: SetSize
**	関数の概要
**	引数  : float width, float height
**	戻り値: void
**	説明  :
******************************************************************************/
void Texture2DGL::SetSize( float width, float height )
{
	m_Width = width;
	m_Height = height;

}


/******************************************************************************
**	関数名: SetPos
**	関数の概要
**	引数  : Vector3 * pos
**	戻り値: void
**	説明  :
******************************************************************************/
void Texture2DGL::SetPos( Vector3 * pos )
{
	m_Pos = *pos;

}


/******************************************************************************
**	関数名: SetPos
**	関数の概要
**	引数  : float x, float y
**	戻り値: void
**	説明  :
******************************************************************************/
void Texture2DGL::SetPos( float x, float y )
{
	m_Pos = Vector3( x, y, 0.0f );

}


/******************************************************************************
**	関数名: SetRot
**	関数の概要
**	引数  : float z
**	戻り値: void
**	説明  :
******************************************************************************/
void Texture2DGL::SetRot( float z )
{
	m_Rot = Vector3( 0.0f, 0.0f, z );

}


/******************************************************************************
**	関数名: SetColor
**	関数の概要
**	引数  : float r, float g, float b, float a
**	戻り値: void
**	説明  :
******************************************************************************/
void Texture2DGL::SetColor( float r, float g, float b, float a )
{
	m_Color = Color( r, g, b, a );

}


/******************************************************************************
**	関数名: SetColor
**	関数の概要
**	引数  : Color col
**	戻り値: void
**	説明  :
******************************************************************************/
void Texture2DGL::SetColor( Color col )
{
	m_Color = col;

}

