/******************************************************************************
**	タイトル  :
**	ファイル名: WindowsSocketService.cpp
**	作成者    : AT-13B-284 出席番号 14 木村 祥貴
**	作成日    : 2016//
**	修正日	　: //
********************************************************************************/

/******************************************************************************
**	インクルードファイル
******************************************************************************/

// 自身ヘッダ
#include "WindowsSocketService.h"


// オブジェクト


// システム


// デバッグ


/******************************************************************************
**	静的メンバ変数
******************************************************************************/
WSADATA WindowsSocketService::m_WsaData;
bool WindowsSocketService::m_bInit;
WindowsSocketService *WindowsSocketService::m_pWinSockSrv;


/******************************************************************************
**	関数名: WindowsSocketService
**		関数の概要
**	引数  : void
**	戻り値: void
**	説明  : コンストラクタ
******************************************************************************/
WindowsSocketService::WindowsSocketService()
{
	m_bInit = false;
	m_pWinSockSrv = new WindowsSocketService;

}


/******************************************************************************
**	関数名: ~WindowsSocketService
**		関数の概要
**	引数  : void
**	戻り値: void
**	説明  : デストラクタ
******************************************************************************/
WindowsSocketService::~WindowsSocketService()
{
	delete m_pWinSockSrv;

}


/******************************************************************************
**	関数名: 初期化処理 Init
**		関数の概要
**	引数  :void
**	戻り値: bool
**	説明  : 初期化処理
******************************************************************************/
bool WindowsSocketService::Init(int a , int b)
{
	if( !m_bInit )
	{
		WSAStartup( MAKEWORD( a, b ), &m_WsaData );
		m_bInit = true;

	}

	return m_bInit;

}


/******************************************************************************
**	関数名: 終了処理 Uninit
**		関数の概要
**	引数  : void
**	戻り値: void
**	説明  :
******************************************************************************/
void WindowsSocketService::Uninit()
{
	WSACleanup();
	m_bInit = false;

}
