/******************************************************************************
タイトル  :
ファイル名: xorshift.cpp
作成者    : AT-12A-244 出席番号 16 木村 祥貴
作成日    : 2016/1/21
******************************************************************************/

/******************************************************************************
更新内容

******************************************************************************/


/******************************************************************************
インクルードファイル
******************************************************************************/
#include "xorshift.h"


/******************************************************************************
マクロ定義
******************************************************************************/

/**** マジックナンバー ****/


/**** 構造体・共用体宣言 ****/

/* シフト演算用 */
// float型
typedef union tagUNIFLOAT
{
	float f;
	unsigned int un;

}UNIFLOAT;

// double型
typedef union tagUNIDOUBLE
{
	double d;
	unsigned long long ull;

}UNIDOUBLE;


/******************************************************************************
プロトタイプ宣言
******************************************************************************/


/******************************************************************************
グローバル変数
******************************************************************************/

/* 乱数の種 */
int g_nseed = 0;
unsigned g_unseed = 0U;
long long g_llseed = 0LL;
unsigned long g_ullseed = 0ULL;
UNIFLOAT g_fseed = { 0.0f };
UNIDOUBLE g_dseed = { 0.0 };


/******************************************************************************
関数名: XorShift::nsrand
関数の概要
引数  : 乱数の種 int seed
戻り値: void
説明  :
******************************************************************************/
void XorShift::nsrand( int seed )
{
	g_nseed = seed;

}


/******************************************************************************
関数名: XorShift::unsrand
関数の概要
引数  : 乱数の種 unsigned int seed
戻り値: void
説明  :
******************************************************************************/
void XorShift::unsrand( unsigned int seed )
{
	g_unseed = seed;

}


/******************************************************************************
関数名: XorShift::llsrand
関数の概要
引数  : 乱数の種 long long seed
戻り値: void
説明  :
******************************************************************************/
void XorShift::llsrand( long long seed )
{
	g_llseed = seed;

}


/******************************************************************************
関数名: XorShift::ulsrand
関数の概要
引数  : 乱数の種 unsigned long seed
戻り値: void
説明  :
******************************************************************************/
void XorShift::ulsrand( unsigned long seed )
{
	g_ullseed = seed;

}


/******************************************************************************
関数名: XorShift::fsrand
関数の概要
引数  : 乱数の種 float seed
戻り値: void
説明  :
******************************************************************************/
void XorShift::fsrand( float seed )
{
	g_fseed.f = seed;

}


/******************************************************************************
関数名: XorShift::dsrand
関数の概要
引数  : 乱数の種 double seed
戻り値: void
説明  :
******************************************************************************/
void XorShift::dsrand( double seed )
{
	g_dseed.d = seed;

}


/******************************************************************************
関数名: XorShift::nrand
関数の概要
引数  : void
戻り値: 乱数 int型
説明  :
******************************************************************************/
int XorShift::nrand( void )
{
	static int x = 2093423641;

	x ^= ( x << 13 );
	x ^= ( x >> 17 );

	return x ^= ( x << ( 5 + g_nseed ) );

}


/******************************************************************************
関数名: XorShift::unrand
関数の概要
引数  : void
戻り値: 乱数 unsigned int 型
説明  :
******************************************************************************/
unsigned int XorShift::unrand( void )
{
	static unsigned int x = 2463534242U;
	
	x ^= ( x << 13 );
	x ^= ( x >> 17 );
	
	return x ^= ( x << ( 5 + g_unseed ) );

}


/******************************************************************************
関数名: XorShift::llrand
関数の概要
引数  : void
戻り値: 乱数 long long 型
説明  :
******************************************************************************/
long long XorShift::llrand( void )
{
	static long long x = 43152675893315280LL;

	x ^= ( x << 13 );
	x ^= ( x >> 7 );
	
	return x = x ^ ( x << ( 17 + g_llseed ) );

}


/******************************************************************************
関数名: XorShift::ullrand
関数の概要
引数  : void
戻り値: 乱数 unsigned long long 型
説明  :
******************************************************************************/
unsigned long long XorShift::ullrand( void )
{
	static unsigned long long x = 88172645463325252ULL;

	x ^= ( x << 13 );
	x ^= ( x >> 7 );
	
	return x ^= ( x << ( 17 + g_ullseed ) );

}


/******************************************************************************
関数名: XorShift::frand
関数の概要
引数  : void
戻り値: 乱数 float 型
説明  :
******************************************************************************/
float XorShift::frand( void )
{
	static UNIFLOAT uniFloat = { 1.234567f };


	uniFloat.un ^= ( uniFloat.un << 13 );
	uniFloat.un ^= ( uniFloat.un >> 7 );
	uniFloat.un ^= ( uniFloat.un << ( 17 + g_fseed.un ) );

	return uniFloat.f;

}


/******************************************************************************
関数名: XorShift::drand
関数の概要
引数  : void
戻り値: 乱数 double 型
説明  :
******************************************************************************/
double XorShift::drand( void )
{
	static UNIDOUBLE uniDouble = { 1.23456789012345 };


	uniDouble.ull ^= ( uniDouble.ull << 13 );
	uniDouble.ull ^= ( uniDouble.ull >> 7 );
	uniDouble.ull ^= ( uniDouble.ull << ( 17 + g_dseed.ull ) );

	return uniDouble.d;

}
